Examinator/src/Documents/ЗаявкаНаОбучениеСУО/ЗаявкаНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаОбучениеСУО</name>
  <registerRecords>InformationRegister.ЗаявкиНаОбучениеСУО</registerRecords>
  <attributes>
    <name>ОбъектЗаявки</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметЗаявки</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Прохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Анкета</name>
    <type>
      <types>DocumentRef.Анкета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Прохождение</name>
      <type>
        <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ЗаявкиНаОбучениеСУО/ЗаявкиНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаявкиНаОбучениеСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗаявки</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметЗаявки</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПН/ДанныеВебКабинетаСУО_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОтборыДанныхВебКабинетаСУО_П/ОтборыДанныхВебКабинетаСУО_П.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтборыДанныхВебКабинетаСУО_П</name>
  <attributes>
    <name>ОтборСсылка</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Отбор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыЗаявокНаОбучениеСУО/СтатусыЗаявокНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаОбучениеСУО</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ЗаявкаНаОбучениеСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ТипОбъектаЗаявки(ОбъектЗаявки) Экспорт
	
	Если ТипЗнч(ОбъектЗаявки) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
		Возврат "Электронный ресурс";
		
	ИначеЕсли ТипЗнч(ОбъектЗаявки) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
		
		Возврат "Программа обучения";
		
	ИначеЕсли ТипЗнч(ОбъектЗаявки) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		
		ВидМероприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЗаявки, "Вид");
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидМероприятия, "Наименование");
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция ОбъектЗаявки(ПредметЗаявки) Экспорт
	
	Если ТипЗнч(ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Возврат Документы.ПроведениеОбученияСУО.СценарийОбучения(ПредметЗаявки);
	КонецЕсли;
	
	Если ТипЗнч(ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		Возврат Документы.ПроведениеПрограммыОбученияСУО.ПрограммаОбучения(ПредметЗаявки);
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции


Функция МожноПодатьЗаявку(ПредметЗаявки, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкиНаОбучениеСУО.Регистратор КАК Заявка
		|ИЗ
		|	РегистрСведений.ЗаявкиНаОбучениеСУО КАК ЗаявкиНаОбучениеСУО
		|ГДЕ
		|	ЗаявкиНаОбучениеСУО.Пользователь = &Пользователь
		|	И ЗаявкиНаОбучениеСУО.ПредметЗаявки = &ПредметЗаявки
		|	И ЗаявкиНаОбучениеСУО.Статус <> &Статус";	
		
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПредметЗаявки", ПредметЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

// ВЕБ-КАБИНЕТ

Процедура ОбновитьДанныеВебКабинета(ЗаявкаНаОбучение, ДополнительныеДанные=Неопределено) Экспорт
	

	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем данные
	
	ТребуемыеДанныеЗаявки = Новый Структура(
	"Текст,
	|Дата,
	|Статус,
	|Комментарий,
	|ДатаРассмотрения,
	|Пользователь,
	|ПредметЗаявки,
	|Проведен",
	"Информация",
	"Дата",
	"Статус",
	"Комментарий",
	"ДатаРассмотрения",
	"Пользователь",
	"ПредметЗаявки",
	"Проведен");
	
	ДанныеЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаявкаНаОбучение, ТребуемыеДанныеЗаявки);
	
	// Записываем описание заявки
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(ЗаявкаНаОбучение, Перечисления.ТипыДанныхВебКабинетаСУО.ОписаниеЗаявки, ДанныеЗаявки.Пользователь);
	
	Если ДанныеЗаявки.Проведен Тогда
	
		ОписаниеЗаявки = Новый Структура("Идентификатор, Статус, Комментарий, ДатаРассмотрения, Пользователь, Текст, Дата, ДополнительныеСведения");
		
		ОписаниеЗаявки.Идентификатор = Строка(ЗаявкаНаОбучение.УникальныйИдентификатор());
		ОписаниеЗаявки.Дата = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеЗаявки.Дата);
		ОписаниеЗаявки.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.ЗначениеВЧисло(ДанныеЗаявки.Статус);
		ОписаниеЗаявки.Комментарий = ДанныеЗаявки.Комментарий;
		ОписаниеЗаявки.ДатаРассмотрения = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеЗаявки.ДатаРассмотрения);
		ОписаниеЗаявки.Пользователь = Строка(ДанныеЗаявки.Пользователь.УникальныйИдентификатор());
		ОписаниеЗаявки.Текст = ДанныеЗаявки.Текст;
		ОписаниеЗаявки.ДополнительныеСведения = ВебКабинетСУО.ТаблицаДополнительныхРеквизитовОбъекта(ЗаявкаНаОбучение);
		
		ОписаниеЗаявкиJSON = ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеЗаявки);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ДанныеЗаявки.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.ОписаниеЗаявки, ЗаявкаНаОбучение, ОписаниеЗаявкиJSON, Перечисления.ФорматыВебДанныхСУ.json);
		
	КонецЕсли;
		
	// Устанавливаем отбор
	
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.УдалитьОтбор(ЗаявкаНаОбучение, ДанныеЗаявки.Пользователь);
	
	Если ДанныеЗаявки.Проведен Тогда
	
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.ДобавитьОтбор(ЗаявкаНаОбучение, ДанныеЗаявки.Пользователь, ДанныеЗаявки.ПредметЗаявки);
		
	КонецЕсли;

	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ПредметЗаявки");
	Поля.Добавить("Пользователь");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Заявка от %1 на ""%2""'"), Данные.Пользователь, Данные.ПредметЗаявки);
	
КонецПроцедуры


#КонецОбласти


#КонецЕсли
